{
    # Object List is a list of objects generated by one camera
    "ObjectList": {
        # AnalyticsId contains value - an identificator - which defines the group of cameras to be used for the multicamera tracking if used (not used in AP solution now)
        "AnalyticsId": 0,
        # EvaluationTimestamp contains timestamp (time from 1.1.1970 in milliseconds) of the moment when the evaluation of the frame happen.
        "EvaluationTimestamp": "1687340971000",
        # Failure can be true or false. If true, the analytics failed to evaluate the frame.  
        "Failure": true,
        # FailureState contains the reason of the failure.
        "FailureState": "AnalIsNotRunning",
        # Id contains the name of the analytics for specific camera.
        "Objects": [
            {
                # Category can contain more than 20 different classes of objects such as car, truck, bus, pedestrian, bicycle, motorcycle, etc.
                "Category": "car",
                # Color can contain the color of the object if it is detected such as red, blue, black, white, silver, etc.
                "Color": "black",
                # Id is a persistent number of a specific object in the frame. It is unique per object in camera analytics but persistant through frames if the object is properly tracked. For each newly discovered object the Id is raised by 1.  
                "Id": "44342",
                # LastState contains the information about the object in the last frame.
                "LastState": {
                    # Bounding Box visualize where the object in x,y frame is located in relative coordinates.
                    "BoundingBox": [
                        0.6716163158416748,
                        0.23661009967327118,
                        0.7052350640296936,
                        0.2971542775630951
                    ],
                    # MapAcceleration contains the acceleration of the object in m/s^2.
                    "MapAcceleration": -3.6512811183929443,
                    # Coordinates in UTM format
                    "MapPosition": [
                        599145.3125,
                        5286569
                    ],
                    # MapSpeed contains the speed of the object in m/s.
                    "MapSpeed": 5.468997001647949,
                    # MapSpeedAngle contains the angle of the speed vector in radians.
                    "MapSpeedAngle": 2.5266385078430176,
                    # Sensor position is not used in AP solution now.
                    "SensorPosition": [
                        0.6888027191162109,
                        0.2795773446559906
                    ],
                    # Timestamp contains the timestamp when the object was discovered for the first time.
                    "Timestamp": "1687340971000",
                    # Latitude and Longitude in the WGS84 format.
                    "WGS84Position": [
                        10.322102786609568,
                        47.724880191237126
                    ]
                }
            },
            
            # ... more objects with the same structure can be added into the Objects array 
        ],
        # Identificator of the message in case the message is splitted into multiple parts.
        "Part": 1,
        # Number of parts of the message in case the message is splitted into multiple parts.
        "TotalParts": 1
    }
}